Revit 2027 API
MechanicalUtils.ConnectDuctPlaceholdersAtTee Method
Overload List
Name | Description
ConnectDuctPlaceholdersAtTee(Document, ElementId, ElementId) |  Connects a pair of placeholders that can intersect in a Tee connection.
ConnectDuctPlaceholdersAtTee(Document, Connector, Connector, Connector) |  Connects a trio of placeholders that can intersect in a Tee connection.
Top
See Also
Reference
MechanicalUtils Class
Autodesk.Revit.DB.Mechanical Namespace